<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
//    // 驱动方式
//    'type'   => 'redis',
//    // 缓存保存目录
//    'path'   => '',
//    // 缓存前缀
//    'prefix' => '',
//    // 缓存有效期 0表示永久缓存
//    'expire' => 0,
//    'default'	=>	[
//        'type'	=>	'redis',
//        'host'	=>	'127.0.0.1',
//        // 全局缓存有效期（0为永久有效）
//        'expire'=>  0,
//        // 缓存前缀
//        'prefix'=>  'think',
//    ],

// 缓存类型为File
    'type'  =>  'file',
    // 全局缓存有效期（0为永久有效）
    'expire'=>  0,
    // 缓存前缀
    'prefix'=>  'think',
    // 缓存目录
    'path'  =>  '../runtime/cache/',
];
